{
  "engine": "bing_maps",
  "params": {
    "q": {
      "required": true,
      "description": "Parameter defines the search query. You can use anything that you would use in a regular Bing Maps search.",
      "group": "search_query"
    },
    "cp": {
      "description": "Parameter defines GPS coordinates of location where you want your q (query) to be applied. It has to be constructed in the next sequence: `latitude` + `~` + `longitude` This will form a string that looks like this: e.g. `40.7455096~-74.0083012`.",
      "group": "geographic_location"
    },
    "setlang": {
      "type": "select",
      "options": [
        "ar",
        "eu",
        "bn",
        "bg",
        "ca",
        "zh-hans",
        "zh-hant",
        "hr",
        "cs",
        "da",
        "nl",
        "en",
        "en-gb",
        "et",
        "fi",
        "fr",
        "gl",
        "de",
        "gu",
        "he",
        "hi",
        "hu",
        "is",
        "it",
        "jp",
        "kn",
        "ko",
        "lv",
        "lt",
        "ms",
        "ml",
        "mr",
        "nb",
        "pl",
        "pt-br",
        "pt-pt",
        "pa",
        "ro",
        "ru",
        "sr",
        "sk",
        "sl",
        "es",
        "sv",
        "ta",
        "te",
        "th",
        "tr",
        "uk",
        "vi"
      ],
      "description": "Parameter defines the language to search with. It follows the 2-character ISO\\_3166-1 format. (e.g., `us` for United States, `de` for Germany, `gb` for United Kingdom, etc.). You can view all supported language codes on Bing Maps.",
      "group": "localization"
    },
    "place_id": {
      "description": "Parameter defines the unique reference to a place on a Bing Map. Place IDs are available for most locations, including businesses, landmarks, parks, and intersections. You can find the place\\_id using our Bing Maps API and Bing Local Pack API. place\\_id can be used without any other optional parameter including q parameter.",
      "group": "advanced_bing_maps_parameters"
    },
    "first": {
      "type": "number",
      "description": "Parameter controls the offset of the local results. This parameter defaults to `0`. (e.g. When `count=10`, the second page result start from `first=10`).",
      "group": "pagination"
    },
    "count": {
      "type": "number",
      "description": "Parameter controls the number of results per page. This parameter is only a suggestion and might not reflect the returned results. Maximum results per page is `30`",
      "group": "pagination"
    }
  },
  "common_params": {
    "engine": {
      "required": true,
      "description": "Set parameter to `bing_maps` to use the Bing Maps API engine.",
      "group": "serpapi_parameters"
    },
    "no_cache": {
      "type": "checkbox",
      "description": "Parameter will force SerpApi to fetch the Bing Maps results even if a cached version is already present. A cache is served only if the query and all parameters are exactly the same. Cache expires after 1h. Cached searches are free, and are not counted towards your searches per month. It can be set to `false` (default) to allow results from the cache, or `true` to disallow results from the cache. no\\_cache and async parameters should not be used together.",
      "group": "serpapi_parameters"
    },
    "async": {
      "description": "Parameter defines the way you want to submit your search to SerpApi. It can be set to `false` (default) to open an HTTP connection and keep it open until you got your search results, or `true` to just submit your search to SerpApi and retrieve them later. In this case, you'll need to use our Searches Archive API to retrieve your results. async and no\\_cache parameters should not be used together. async should not be used on accounts with Ludicrous Speed enabled.",
      "group": "serpapi_parameters"
    },
    "zero_trace": {
      "description": "Enterprise only. Parameter enables ZeroTrace mode. It can be set to `false` (default) or `true`. Enable this mode to skip storing search parameters, search files, and search metadata on our servers. This may make debugging more difficult.",
      "group": "serpapi_parameters"
    },
    "api_key": {
      "required": true,
      "description": "Parameter defines the SerpApi private key to use.",
      "group": "serpapi_parameters"
    },
    "output": {
      "description": "Parameter defines the final output you want. It can be set to json (default) to get a structured `JSON` of the results, or `html` to get the raw html retrieved.",
      "group": "serpapi_parameters"
    },
    "json_restrictor": {
      "description": "Parameter defines the fields you want to restrict in the outputs for smaller, faster responses. See JSON Restrictor for more details.",
      "group": "serpapi_parameters"
    }
  }
}