{
  "engine": "duckduckgo_maps",
  "params": {
    "q": {
      "required": true,
      "description": "Parameter defines the query you want to search. You can use anything that you would use in a regular DuckDuckGo Maps search.",
      "group": "search_query"
    },
    "bbox": {
      "description": "Parameter defines an area where you want your q (query) to be applied. The value consists of latitude/longitude pair. The first pair marks the top left corner and the second pair marks the bottom right corner of the map area box. It has to be constructed in the next sequence: `latitude_tl` + `,` + `longitude_tl` + `,` + `latitude_br` + `,` + `longitude_br` This will form a string that looks like this: e.g. `30.341552964181687,-97.87405344947078,30.16321730812698,-97.50702877159034` DuckDuckGo Maps uses bbox parameter as the default way to pass GPS coordinates. When unsure what the value should be, visit DuckDuckGo Maps, search for a query in a desired location, and copy a value from the URL. Parameter can't be used with lat and lon parameters.",
      "group": "geographic_location"
    },
    "lat": {
      "type": "number",
      "description": "Defines a GPS latitude for the search origin. Parameter is required when using lon parameter.",
      "group": "geographic_location"
    },
    "lon": {
      "type": "number",
      "description": "Defines a GPS longitude for the search origin. Parameter is required when using lat parameter.",
      "group": "geographic_location"
    },
    "strict_bbox": {
      "type": "select",
      "options": [
        [
          "0",
          "0 - Don't follow `bbox` GPS coordinates"
        ],
        [
          "1",
          "1 - Follow `bbox` GPS coordinates"
        ]
      ],
      "description": "Parameter defines whether you strictly want your search to follow the bbox coordinates. It can be set to `1` (strict - default), or `0` (off).",
      "group": "advanced_duckduckgo_maps_filters"
    }
  },
  "common_params": {
    "engine": {
      "required": true,
      "description": "Set parameter to `duckduckgo_maps` to use the DuckDuckGo Maps API engine.",
      "group": "serpapi_parameters"
    },
    "no_cache": {
      "type": "checkbox",
      "description": "Parameter will force SerpApi to fetch the DuckDuckGo Maps results even if a cached version is already present. A cache is served only if the query and all parameters are exactly the same. Cache expires after 1h. Cached searches are free, and are not counted towards your searches per month. It can be set to `false` (default) to allow results from the cache, or `true` to disallow results from the cache. no\\_cache and async parameters should not be used together.",
      "group": "serpapi_parameters"
    },
    "async": {
      "description": "Parameter defines the way you want to submit your search to SerpApi. It can be set to `false` (default) to open an HTTP connection and keep it open until you got your search results, or `true` to just submit your search to SerpApi and retrieve them later. In this case, you'll need to use our Searches Archive API to retrieve your results. async and no\\_cache parameters should not be used together. async should not be used on accounts with Ludicrous Speed enabled.",
      "group": "serpapi_parameters"
    },
    "zero_trace": {
      "description": "Enterprise only. Parameter enables ZeroTrace mode. It can be set to `false` (default) or `true`. Enable this mode to skip storing search parameters, search files, and search metadata on our servers. This may make debugging more difficult.",
      "group": "serpapi_parameters"
    },
    "api_key": {
      "required": true,
      "description": "Parameter defines the SerpApi private key to use.",
      "group": "serpapi_parameters"
    },
    "output": {
      "description": "Parameter defines the final output you want. It can be set to json (default) to get a structured `JSON` of the results, or `html` to get the raw html retrieved.",
      "group": "serpapi_parameters"
    },
    "json_restrictor": {
      "description": "Parameter defines the fields you want to restrict in the outputs for smaller, faster responses. See JSON Restrictor for more details.",
      "group": "serpapi_parameters"
    }
  }
}