{
  "engine": "yandex_videos",
  "params": {
    "text": {
      "required": true,
      "description": "Parameter defines the search query. You can use anything that you would use in a regular Yandex Videos search.",
      "group": "search_query"
    },
    "yandex_domain": {
      "type": "select",
      "options": [
        "yandex.com",
        "yandex.ru",
        "yandex.by",
        "yandex.kz",
        "yandex.uz",
        "yandex.com.tr"
      ],
      "description": "Parameter defines the Yandex Videos domain to use. It defaults to `yandex.com`. Head to the Yandex domains for a full list of supported Yandex domains.",
      "group": "localization"
    },
    "duration": {
      "type": "select",
      "options": [
        "short",
        "medium",
        "long"
      ],
      "description": "Parameter is used for filtering videos by duration. It can be set to: `short` - Less than 10 minutes `medium` - 10-65 minutes `long` - More than 65 minutes",
      "group": "advanced_yandex_videos_parameters"
    },
    "hd": {
      "type": "checkbox",
      "description": "Parameter is used for filtering videos by quality.",
      "group": "advanced_yandex_videos_parameters"
    },
    "within": {
      "type": "select",
      "options": [
        [
          "0",
          "All time"
        ],
        [
          "9",
          "Recent"
        ],
        [
          "7",
          "Today"
        ],
        [
          "77",
          "Last day"
        ],
        [
          "1",
          "Last 2 weeks"
        ],
        [
          "2",
          "Last month"
        ]
      ],
      "description": "Parameter is used to limit the search results to specific time period. It defaults to `all time`",
      "group": "advanced_yandex_videos_parameters"
    },
    "p": {
      "type": "number",
      "description": "Parameter defines the page number. Pagination starts from `0`, and it can return up to 30 results.",
      "group": "pagination"
    }
  },
  "common_params": {
    "engine": {
      "required": true,
      "description": "Set parameter to `yandex_videos` to use the Yandex Videos API engine.",
      "group": "serpapi_parameters"
    },
    "device": {
      "type": "device",
      "options": [
        "desktop",
        "tablet",
        "mobile"
      ],
      "description": "Parameter defines the device to use to get the results. It can be set to `desktop` (default) to use a regular browser, `tablet` to use a tablet browser (currently using iPads), or `mobile` to use a mobile browser.",
      "group": "serpapi_parameters"
    },
    "no_cache": {
      "type": "checkbox",
      "description": "Parameter will force SerpApi to fetch the Yandex Videos results even if a cached version is already present. A cache is served only if the query and all parameters are exactly the same. Cache expires after 1h. Cached searches are free, and are not counted towards your searches per month. It can be set to `false` (default) to allow results from the cache, or `true` to disallow results from the cache. no\\_cache and async parameters should not be used together.",
      "group": "serpapi_parameters"
    },
    "async": {
      "description": "Parameter defines the way you want to submit your search to SerpApi. It can be set to `false` (default) to open an HTTP connection and keep it open until you got your search results, or `true` to just submit your search to SerpApi and retrieve them later. In this case, you'll need to use our Searches Archive API to retrieve your results. async and no\\_cache parameters should not be used together. async should not be used on accounts with Ludicrous Speed enabled.",
      "group": "serpapi_parameters"
    },
    "zero_trace": {
      "description": "Enterprise only. Parameter enables ZeroTrace mode. It can be set to `false` (default) or `true`. Enable this mode to skip storing search parameters, search files, and search metadata on our servers. This may make debugging more difficult.",
      "group": "serpapi_parameters"
    },
    "api_key": {
      "required": true,
      "description": "Parameter defines the SerpApi private key to use.",
      "group": "serpapi_parameters"
    },
    "output": {
      "description": "Parameter defines the final output you want. It can be set to json (default) to get a structured `JSON` of the results, or `html` to get the raw html retrieved.",
      "group": "serpapi_parameters"
    },
    "json_restrictor": {
      "description": "Parameter defines the fields you want to restrict in the outputs for smaller, faster responses. See JSON Restrictor for more details.",
      "group": "serpapi_parameters"
    }
  }
}